In [1]:
 from pandas import Series, DataFrame

In [2]:
import pandas as pd

In [3]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [4]:
 frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [5]:
 DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [6]:
 frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
 ....: index=['one', 'two', 'three', 'four', 'five'])

In [7]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [8]:
 frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [9]:
 frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [10]:
 frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [11]:
frame2.ix['three']

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [12]:
frame2['debt'] = 16.5

In [13]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [15]:
import numpy as np

In [16]:
 frame2['debt'] = np.arange(5.)

In [17]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [18]:
 val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [19]:
 frame2['debt'] = val

In [20]:
 frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [26]:
task = {'names': ['Shahzad', 'Umer', 'Ahsan', 'Furqan', 'Jawwad'],
 'age': [20, 21, 22, 23, 24],
 'percentage': [51, 71, 63, 42, 92]}
myframe = DataFrame(task)
myframe

     names  age  percentage
0  Shahzad   20          51
1     Umer   21          71
2    Ahsan   22          63
3   Furqan   23          42
4   Jawwad   24          92

In [28]:
myframe['age2']=np.random.randint(20,30,5)

In [29]:
myframe

     names  age  percentage  age2
0  Shahzad   20          51    27
1     Umer   21          71    26
2    Ahsan   22          63    22
3   Furqan   23          42    20
4   Jawwad   24          92    23

In [30]:
data={"Ai for Everyone":[78,89,78,76,49,90,34,76,98,100].
     "Python":[np.random.randint(20,30,10)]}
f=DataFrame(data)
f

SyntaxError: invalid syntax (<ipython-input-30-bfe06bcfe7e4>, line 2)